# :heavy_check_mark:Terragrunt Plan
```hcl
Group 1
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample2/hcl/network
Group 2
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample2/hcl/ec2

Plan: 10 to add, 0 to change, 0 to destroy.
Plan: 6 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Details</summary>


```hcl
Group 1
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample2/hcl/network
Group 2
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample2/hcl/ec2

--------
COMMAND: terragrunt run-all plan  -no-color terragrunt-working-dir=hcl   --terragrunt-non-interactive
WORKSPACE: tc3-cicd
AWS_PROFILE: default
--------
[INFO] Getting version from tgenv-version-name
[INFO] TGENV_VERSION is 0.38.0

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "tc3-cicd-vpc"
        }
      + tags_all = {
          + "Name" = "tc3-cicd-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "tc3-cicd-vpc-public"
        }
      + tags_all         = {
          + "Name" = "tc3-cicd-vpc-public"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.30.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tc3-cicd-vpc-public-ap-northeast-1a"
        }
      + tags_all                                       = {
          + "Name" = "tc3-cicd-vpc-public-ap-northeast-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.30.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tc3-cicd-vpc-public-ap-northeast-1c"
        }
      + tags_all                                       = {
          + "Name" = "tc3-cicd-vpc-public-ap-northeast-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.30.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tc3-cicd-vpc-public-ap-northeast-1d"
        }
      + tags_all                                       = {
          + "Name" = "tc3-cicd-vpc-public-ap-northeast-1d"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "172.30.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "tc3-cicd-vpc"
        }
      + tags_all                             = {
          + "Name" = "tc3-cicd-vpc"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + azs                                         = [
      + "ap-northeast-1a",
      + "ap-northeast-1c",
      + "ap-northeast-1d",
    ]
  + cgw_arns                                    = []
  + cgw_ids                                     = []
  + database_nat_gateway_route_ids              = []
  + database_route_table_association_ids        = []
  + database_route_table_ids                    = []
  + database_subnet_arns                        = []
  + database_subnets                            = []
  + database_subnets_cidr_blocks                = []
  + database_subnets_ipv6_cidr_blocks           = []
  + default_network_acl_id                      = (known after apply)
  + default_route_table_id                      = (known after apply)
  + default_security_group_id                   = (known after apply)
  + elasticache_route_table_association_ids     = []
  + elasticache_route_table_ids                 = []
  + elasticache_subnet_arns                     = []
  + elasticache_subnets                         = []
  + elasticache_subnets_cidr_blocks             = []
  + elasticache_subnets_ipv6_cidr_blocks        = []
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  + intra_route_table_association_ids           = []
  + intra_route_table_ids                       = []
  + intra_subnet_arns                           = []
  + intra_subnets                               = []
  + intra_subnets_cidr_blocks                   = []
  + intra_subnets_ipv6_cidr_blocks              = []
  + name                                        = "tc3-cicd-vpc"
  + nat_ids                                     = []
  + nat_public_ips                              = []
  + natgw_ids                                   = []
  + outpost_subnet_arns                         = []
  + outpost_subnets                             = []
  + outpost_subnets_cidr_blocks                 = []
  + outpost_subnets_ipv6_cidr_blocks            = []
  + private_ipv6_egress_route_ids               = []
  + private_nat_gateway_route_ids               = []
  + private_route_table_association_ids         = []
  + private_route_table_ids                     = []
  + private_subnet_arns                         = []
  + private_subnets                             = []
  + private_subnets_cidr_blocks                 = []
  + private_subnets_ipv6_cidr_blocks            = []
  + public_internet_gateway_route_id            = (known after apply)
  + public_route_table_association_ids          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_route_table_ids                      = [
      + (known after apply),
    ]
  + public_subnet_arns                          = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_subnets_cidr_blocks                  = [
      + "172.30.1.0/24",
      + "172.30.2.0/24",
      + "172.30.3.0/24",
    ]
  + public_subnets_ipv6_cidr_blocks             = []
  + redshift_public_route_table_association_ids = []
  + redshift_route_table_association_ids        = []
  + redshift_route_table_ids                    = []
  + redshift_subnet_arns                        = []
  + redshift_subnets                            = []
  + redshift_subnets_cidr_blocks                = []
  + redshift_subnets_ipv6_cidr_blocks           = []
  + this_customer_gateway                       = {}
  + vpc_arn                                     = (known after apply)
  + vpc_cidr_block                              = "172.30.0.0/16"
  + vpc_enable_dns_hostnames                    = true
  + vpc_enable_dns_support                      = true
  + vpc_flow_log_destination_type               = "cloud-watch-logs"
  + vpc_id                                      = (known after apply)
  + vpc_instance_tenancy                        = "default"
  + vpc_ipv6_association_id                     = (known after apply)
  + vpc_ipv6_cidr_block                         = (known after apply)
  + vpc_main_route_table_id                     = (known after apply)
  + vpc_owner_id                                = (known after apply)
  + vpc_secondary_cidr_blocks                   = []

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-0701e21c502689c31"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "tc3-cicd-bastion"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "xxxxxxxx"
      + tags                                 = {
          + "Name" = "tc3-cicd-bastion"
        }
      + tags_all                             = {
          + "Name" = "tc3-cicd-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_key_pair.auth will be created
  + resource "aws_key_pair" "auth" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "tc3-cicd-bastion"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = (known after apply)
    }

  # aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "bastion-sg"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "egress all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "3.112.23.0/29",
                ]
              + description      = "tokyo-region-instance-connect"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "tc3-cicd-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tc3-cicd-bastion-sg"
        }
      + tags_all               = {
          + "Name" = "tc3-cicd-bastion-sg"
        }
      + vpc_id                 = "xxxxxxxx"
    }

  # local_file.private_key_pem will be created
  + resource "local_file" "private_key_pem" {
      + content              = (sensitive)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./.key_pair/tc3-cicd-bastion.id_rsa"
      + id                   = (known after apply)
    }

  # local_file.public_key_openssh will be created
  + resource "local_file" "public_key_openssh" {
      + content              = (sensitive)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./.key_pair/tc3-cicd-bastion.id_rsa.pub"
      + id                   = (known after apply)
    }

  # tls_private_key.default will be created
  + resource "tls_private_key" "default" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
<!-- plan -->